package lesson29;


public class MyLovelyPalindrom {
    public static void main(String[] args) {
        // "А роза упал на лапу Азора" - >>
        // "pop"  - true
        // "JavaScript"  - > false
        // Решение
        // 1. Привести к одному регистру  // туловер
        // 2. Убрать пробелы. // сложновато, надо писать отельный метод
        // 3. Перевернуть слово или всю фразу / стринг  // есть такой метод
        // 4. Сравнить инпут с аутпутом // equals
        // 5. Вернуть сравнение // return
    }
}
